CREATE_GAME_TIME = 180
VALUES = ['Туз', 'Король', 'Дама', 'Валет', '10', '9', '8', '7', '6', '5', '4', '3', '2']
ACES = 'a'
KINGS = 'k'
QUEENS = 'q'
JACKS = 'j'
TEN = '10'
NINE = '9'
EIGHT = '8'
SEVEN = '7'
SIX = '6'
FIVE = '5'
FOUR = '4'
THREE = '3'
TWO = '2'

HEARTS = 'h'  # черви
CLUBS = 'c'  # крести
DIAMONDS = 'd'  # буби
SPADES = 's'  # пики


SUITS_STR = {
    'a_s': 'spade_A',
    '2_s': 'spade_2',
    '3_s': 'spade_3',
    '4_s': 'spade_4',
    '5_s': 'spade_5',
    '6_s': 'spade_6',
    '7_s': 'spade_7',
    '8_s': 'spade_8',
    '9_s': 'spade_9',
    '10_s': 'spade_10',
    'j_s': 'spade_J',
    'q_s': 'spade_Q',
    'k_s': 'spade_K',

    'a_h': 'heart_A',
    '2_h': 'heart_2',
    '3_h': 'heart_3',
    '4_h': 'heart_4',
    '5_h': 'heart_5',
    '6_h': 'heart_6',
    '7_h': 'heart_7',
    '8_h': 'heart_8',
    '9_h': 'heart_9',
    '10_h': 'heart_10',
    'j_h': 'heart_J',
    'q_h': 'heart_Q',
    'k_h': 'heart_K',

    'a_c': 'club_A',
    '2_c': 'club_2',
    '3_c': 'club_3',
    '4_c': 'club_4',
    '5_c': 'club_5',
    '6_c': 'club_6',
    '7_c': 'club_7',
    '8_c': 'club_8',
    '9_c': 'club_9',
    '10_c': 'club_10',
    'j_c': 'club_J',
    'q_c': 'club_Q',
    'k_c': 'club_K',

    'a_d': 'diamond_A',
    '2_d': 'diamond_2',
    '3_d': 'diamond_3',
    '4_d': 'diamond_4',
    '5_d': 'diamond_5',
    '6_d': 'diamond_6',
    '7_d': 'diamond_7',
    '8_d': 'diamond_8',
    '9_d': 'diamond_9',
    '10_d': 'diamond_10',
    'j_d': 'diamond_J',
    'q_d': 'diamond_Q',
    'k_d': 'diamond_K'
}

STIKERS = {
    'a_s': '♠️A',
    '2_s': '♠️2',
    '3_s': '♠️3',
    '4_s': '♠️4',
    '5_s': '♠️5',
    '6_s': '♠️6',
    '7_s': '♠️7',
    '8_s': '♠️8',
    '9_s': '♠️9',
    '10_s': '♠️10',
    'j_s': '♠️J',
    'q_s': '♠️Q',
    'k_s': '♠️K',

    'a_h': '♥️A',
    '2_h': '♥️2',
    '3_h': '♥️3',
    '4_h': '♥️4',
    '5_h': '♥️5',
    '6_h': '♥️6',
    '7_h': '♥️7',
    '8_h': '♥️8',
    '9_h': '♥️9',
    '10_h': '♥️10',
    'j_h': '♥️J',
    'q_h': '♥️Q',
    'k_h': '♥️K',

    'a_c': '♣️A',
    '2_c': '♣️2',
    '3_c': '♣️3',
    '4_c': '♣️4',
    '5_c': '♣️5',
    '6_c': '♣️6',
    '7_c': '♣️7',
    '8_c': '♣️8',
    '9_c': '♣️9',
    '10_c': '♣️10',
    'j_c': '♣️J',
    'q_c': '♣️Q',
    'k_c': '♣️K',

    'a_d': '♦️A',
    '2_d': '♦️2',
    '3_d': '♦️3',
    '4_d': '♦️4',
    '5_d': '♦️5',
    '6_d': '♦️6',
    '7_d': '♦️7',
    '8_d': '♦️8',
    '9_d': '♦️9',
    '10_d': '♦️10',
    'j_d': '♦️J',
    'q_d': '♦️Q',
    'k_d': '♦️K'

}

INVERSE_STIKERS = {
    '♠️A': 'a_s',
    '♠️2': '2_s',
    '♠️3': '3_s',
    '♠️4': '4_s',
    '♠️5': '5_s',
    '♠️6': '6_s',
    '♠️7': '7_s',
    '♠️8': '8_s',
    '♠️9': '9_s',
    '♠️10': '10_s',
    '♠️J': 'j_s',
    '♠️Q': 'q_s',
    '♠️K': 'k_s',

    '♥️A': 'a_h',
    '♥️2': '2_h',
    '♥️3': '3_h',
    '♥️4': '4_h',
    '♥️5': '5_h',
    '♥️6': '6_h',
    '♥️7': '7_h',
    '♥️8': '8_h',
    '♥️9': '9_h',
    '♥️10': '10_h',
    '♥️J': 'j_h',
    '♥️Q': 'q_h',
    '♥️K': 'k_h',

    '♣️A': 'a_c',
    '♣️2': '2_c',
    '♣️3': '3_c',
    '♣️4': '4_c',
    '♣️5': '5_c',
    '♣️6': '6_c',
    '♣️7': '7_c',
    '♣️8': '8_c',
    '♣️9': '9_c',
    '♣️10': '10_c',
    '♣️J': 'j_c',
    '♣️Q': 'q_c',
    '♣️K': 'k_c',

    '♦️A': 'a_d',
    '♦️2': '2_d',
    '♦️3': '3_d',
    '♦️4': '4_d',
    '♦️5': '5_d',
    '♦️6': '6_d',
    '♦️7': '7_d',
    '♦️8': '8_d',
    '♦️9': '9_d',
    '♦️10': '10_d',
    '♦️J': 'j_d',
    '♦️Q': 'q_d',
    '♦️K': 'k_d'
}

ITEMS = {
    'Туз': 'a',
    'Король': 'k',
    'Дама': 'q',
    'Валет': 'j',
    '10': '10',
    '9': '9',
    '8': '8',
    '7': '7',
    '6': '6',
    '5': '5',
    '4': '4',
    '3': '3',
    '2': '2',
}